# IFCHybridImport Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCHybridImport Methods
IFCHybridImport Class See Also
---
The IFCHybridImport type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateMap |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ImportElements | Imports IFC Elements using non-open-source framework |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
IFCHybridImport Class
Autodesk.Revit.DB.IFC Namespace